#+TITLE: Neworg

* HERE IS SOME CODE
#+BEGIN_SRC python :results output
x = 0


for t in range (10):
    x = x + 1
    print(x)

#+END_SRC


* PYTHON POWERED WEB SCRAPER

#+BEGIN_SRC python :results output

import requests
from bs4 import BeautifulSoup as bs
import os
import subprocess

url = 'https://worldometers.info/coronavirus/#countries'
page = requests.get(url)
soup = bs(page.content, 'html.parser')
results = soup.find(id='main_table_countries_today')
content = results.text.split()

sp = content.index('USA')
result_str = content[int(sp + 1):int(sp + 14)]

clean_list = []

for x in result_str:
    a = str(x.replace(',',''))
    clean_list.append(a)


print('USA COVID STATS')

for x in result_str:
    print(x)

#+END_SRC

#+RESULTS:
#+begin_example
USA COVID STATS
6,048,317
+1,683
184,803
+7
3,348,377
+437
2,515,137
16,231
18,256
558
79,472,486
239,874
331,309,290
#+end_example



* HERE IS A TABLE OF APPS

|----------+-------+-----------+----------+-----+-------------+-------------|
| APP NAME | RANK  | INSTALLED | TERMINAL | GUI | DEVELOPMENT | HAS PLUGINS |
|----------+-------+-----------+----------+-----+-------------+-------------|
| code     | ****  | no        | no       | yes | good        | yes         |
| atom     | ***** | no        | no       | yes | great       | yes         |
| neovim   | ***** | yes       | yes      | no  | great       | yes         |
| emacs    | ***** | yes       | yes      | yes | great       | yes         |
| gedit    | *     | no        | no       | yes | ok          | no          |
| pycharm  | ***   | no        | no       | yes | great       | yes         |
| sublime  | ****  | no        | no       | yes | great       | yes         |
| geany    | **    | no        | no       | yes | ok          |             |
|----------+-------+-----------+----------+-----+-------------+-------------|
